# Options
cask_args appdir: "~/Applications", require_sha: true

# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "buo/cask-upgrade"


############
# BREW
############

# Utility functions
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "dockutil"

# System functions
brew "antigen"
brew "curl", link: true
brew "htop"
brew "jq"
brew "yq"
brew "fd"
brew "rsync"
brew "ssh-copy-id"
brew "tree"
brew "neovim"
brew "wget"
brew "m-cli"
brew "fzf"
brew "bat"
brew "exa"
brew "rg"
brew "mc"
brew "tmux"
# brew "zoxide"
brew "koekeishiya/formulae/skhd"


# Development
brew "brew-gem"
brew "nvm"
brew "git"
brew "rbenv"
brew "yarn"

# Image & video
brew "ffmpeg"
brew "imagemagick"


############
# CASK
############

cask "affinity-designer"
cask "affinity-photo"


cask "balenaetcher"
cask "discord"
cask "docker"
cask "dropbox", args: { require_sha: false }
cask "freecad"
cask "google-chrome", args: { require_sha: false }
cask "google-drive", args: { require_sha: false }
# cask "google-photos-backup-and-sync"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "keepassxc"
cask "keka"
cask "mqtt-explorer"
cask "namechanger"
cask "obs"
cask "screens-connect"
cask "signal"
cask "spotify", args: { require_sha: false }
cask "steam"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"

# MacOS mods
cask "alfred"
cask "alt-tab"
cask "spotmenu"
cask "stats"
cask "rectangle"
cask "apptrap"

# Fonts
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-lilex-nerd-font"
cask "font-meslo-lg-nerd-font"

# Quicklook
cask "betterzip"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json", args: { require_sha: false }
cask "quicklookase"


############
# MAS
############

mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Boxy SVG", id: 611658502
mas "DaVinci Resolve", id: 571213070
mas "LittleIpsum", id: 405772121
mas "Hidden Bar", id: 1452453066
mas "Steam Link", id: 1246969117
mas "Slack for Desktop", id: 803453959
mas "VPN Unlimited - WiFi Proxy", id: 727593140